#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.terraform_remote_state.vpc: Reading...[0m[0m
[0m[1mdata.terraform_remote_state.vpc: Read complete after 0s[0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-dev-cluster/cluster][0m
[0m[1mmodule.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d9b80ef0ea23ef75][0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mmodule.eks.aws_security_group.node[0]: Refreshing state... [id=sg-05c46e6dff137826d][0m
[0m[1mmodule.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-dev-cluster-cluster-20231022133042957900000004][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_iam_role.this[0]: Refreshing state... [id=bottlerocket_nodes-eks-node-group-20231022133042956900000003][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].data.aws_caller_identity.current: Read complete after 0s [id=152691795422][0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Read complete after 0s [id=152691795422][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=152691795422][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=152691795422][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::152691795422:assumed-role/gh-action-role/GitHub-OIDC-TERRAFORM][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=bottlerocket_nodes-eks-node-group-20231022133042956900000003-20231022133043458800000006][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=bottlerocket_nodes-eks-node-group-20231022133042956900000003-20231022133043431700000005][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=bottlerocket_nodes-eks-node-group-20231022133042956900000003-20231022133043519700000007][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-dev-cluster-cluster-20231022133042957900000004-20231022133043659900000008][0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-dev-cluster-cluster-20231022133042957900000004-20231022133043667100000009][0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2529591203][0m
[0m[1mmodule.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=3d9482df-eb16-4741-850a-8973102eccb6][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1777833058][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3263974390][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1209514876][0m
[0m[1mmodule.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3694768130][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2450120907][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-8583327][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-4138259200][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2169887978][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1569599737][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4191261462][0m
[0m[1mmodule.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3956394140][0m
[0m[1mmodule.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-dev-cluster][0m
[0m[1mmodule.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::152691795422:policy/eks-dev-cluster-cluster-ClusterEncryption2023102213310461230000000a][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-dev-cluster-cluster-20231022133042957900000004-2023102213310493560000000b][0m
[0m[1mmodule.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-dev-cluster][0m
[0m[1mmodule.eks.time_sleep.this[0]: Refreshing state... [id=2023-10-22T13:41:58Z][0m
[0m[1mdata.aws_eks_cluster_auth.cluster: Reading...[0m[0m
[0m[1mdata.aws_eks_cluster_auth.cluster: Read complete after 0s [id=eks-dev-cluster][0m
[0m[1mmodule.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::152691795422:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d20f4f3e63b0b7a2][0m
[0m[1mmodule.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-dev-cluster:bottlerocket_nodes-20231022142719580600000001][0m
[0m[1mmodule.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-dev-cluster:coredns][0m
[0m[1mmodule.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-dev-cluster:kube-proxy][0m
[0m[1mmodule.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-dev-cluster:vpc-cni][0m
[0m[1mmodule.lb_role.aws_iam_role.this[0]: Refreshing state... [id=aws-load-balancer-controller-dev][0m
[0m[1mmodule.lb_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::152691795422:policy/AmazonEKS_AWS_Load_Balancer_Controller-20231022145135328400000001][0m
[0m[1mmodule.lb_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=aws-load-balancer-controller-dev-20231022145135602400000002][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.eks.aws_eks_addon.this["coredns"][0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_eks_addon" "this" {
      [31m-[0m [0m[1m[0maddon_name[0m[0m        = "coredns" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0maddon_version[0m[0m     = "v1.10.1-eksbuild.4" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0marn[0m[0m               = "arn:aws:eks:us-east-1:152691795422:addon/eks-dev-cluster/coredns/5ec5abe4-eb8b-ce77-67d4-5b9fa8946315" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcluster_name[0m[0m      = "eks-dev-cluster" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreated_at[0m[0m        = "2023-10-22T14:28:47Z" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                = "eks-dev-cluster:coredns" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmodified_at[0m[0m       = "2023-10-22T14:29:26Z" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresolve_conflicts[0m[0m = "OVERWRITE" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m              = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m          = {
          [31m-[0m [0m"ManagedBy" = "terraform"
          [31m-[0m [0m"Project"   = "golden-devops"
        } [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mtimeouts {}
    }

[1m  # module.eks.aws_eks_addon.this["kube-proxy"][0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_eks_addon" "this" {
      [31m-[0m [0m[1m[0maddon_name[0m[0m        = "kube-proxy" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0maddon_version[0m[0m     = "v1.27.6-eksbuild.2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0marn[0m[0m               = "arn:aws:eks:us-east-1:152691795422:addon/eks-dev-cluster/kube-proxy/d6c5abe4-eb87-1715-b510-c1f439916dad" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcluster_name[0m[0m      = "eks-dev-cluster" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreated_at[0m[0m        = "2023-10-22T14:28:47Z" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                = "eks-dev-cluster:kube-proxy" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmodified_at[0m[0m       = "2023-10-22T14:29:20Z" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresolve_conflicts[0m[0m = "OVERWRITE" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m              = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m          = {
          [31m-[0m [0m"ManagedBy" = "terraform"
          [31m-[0m [0m"Project"   = "golden-devops"
        } [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mtimeouts {}
    }

[1m  # module.eks.aws_eks_addon.this["vpc-cni"][0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_eks_addon" "this" {
      [31m-[0m [0m[1m[0maddon_name[0m[0m        = "vpc-cni" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0maddon_version[0m[0m     = "v1.15.1-eksbuild.1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0marn[0m[0m               = "arn:aws:eks:us-east-1:152691795422:addon/eks-dev-cluster/vpc-cni/18c5abe4-eb87-400b-4bf0-d262af0dcfc1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcluster_name[0m[0m      = "eks-dev-cluster" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreated_at[0m[0m        = "2023-10-22T14:28:47Z" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                = "eks-dev-cluster:vpc-cni" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmodified_at[0m[0m       = "2023-10-22T14:29:21Z" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresolve_conflicts[0m[0m = "OVERWRITE" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m              = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m          = {
          [31m-[0m [0m"ManagedBy" = "terraform"
          [31m-[0m [0m"Project"   = "golden-devops"
        } [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mtimeouts {}
    }

[1m  # module.eks.aws_eks_cluster.this[0][0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_eks_cluster" "this" {
      [31m-[0m [0m[1m[0marn[0m[0m                       = "arn:aws:eks:us-east-1:152691795422:cluster/eks-dev-cluster" [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mcertificate_authority[0m[0m     = [
          [33m~[0m [0m{
              [33m~[0m [0mdata = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCRENDQWV5Z0F3SUJBZ0lIU0VTV2gya3JUekFOQmdrcWhraUc5dzBCQVFzRkFEQVZNUk13RVFZRFZRUUQKRXdwcmRXSmxjbTVsZEdWek1CNFhEVEl6TVRBeU1qRXpNekV5TVZvWERUTXpNVEF4T1RFek16WXlNVm93RlRFVApNQkVHQTFVRUF4TUthM1ZpWlhKdVpYUmxjekNDQVNJd0RRWUpLb1pJaHZjTkFRRUJCUUFEZ2dFUEFEQ0NBUW9DCmdnRUJBS1lIeWRtNTRuUEYwdDF5eUp2ZEJYcHN5ZURmdVgzcGU4czJEMVFYUlMwMXRtdDVMZDJhd0FjWVhab1AKU1cxTnJmTWF4cEV5TktqVlQvdHhnMmJMRWVHcC9ubjhNVERxSGYxWnhYV2c2a1Zsa3R6UjRSLytaTXR2ajJteQpaVjBxMWNCaGN2NU5CNzRWNVpvMTlLSGM1NkdmTjRTOHBKa2tnN2JIdktYcWwxdFJ4SkxETXZmYkt5UlJQdlZRCkJxVEsrODJ1YkhxbmdJeEM4VS9nOEZhTUEyVGQwQjIzcjVzWVN0SFRoNEQydFlGdlhNa251b21uaUFxaGVmOEsKQzh5cjM2bkQ5RU10Y0pUTlREVmFLamhqU0FzaytvK1cwaldYbXpjVi9zOVFsSmlFcEV5MjlWU1JpcmtQY2NGaAoxcnRUWlIwWUpTUjlGVVZQVkI5TEVYK2VTWWNDQXdFQUFhTlpNRmN3RGdZRFZSMFBBUUgvQkFRREFnS2tNQThHCkExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRlBUVmY4OHJBdW8vQzBwOG9Mb09Bc052bFZOTk1CVUcKQTFVZEVRUU9NQXlDQ210MVltVnlibVYwWlhNd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDMExNS0luRytMUgp4bi81VkZwMXRjUWw3cSttaGZqVE85OHRvUU56UTlkZFAwQVY3UGJPVGhMd3MzaEdadlB1cUVYc3UzQTJTWnZVCmxxSUxIeERadzF5S3o2WmF1Yklza2RCL0xON0NJRFM2QVJ6QWd6UWwyYnYzcktNNTgvNG1CVi9BNm9TemJlQzcKbVZYYVFuMVJVTDRKMVlaQ2tUbXZ1KzMxQUZKa21rcng2cXB0U0NnSEMzUnR4VDhnTC9qa05zdEt3U1VXVjVyQQpqVEtpRHliMVVRdjJZQ2ZObVhzanU1Y3J6NWtVTkdNVFRya3I3NXlvYU5FeG96azdEQW0xSFpNcUhKaW5yYnpCCmxNN0VhVk11UEQ5eXIrSENNWEdUdWJVdUc1bDVIZGZ5eFN1dEVVZXljcTYzN2lsMUV4U05kKy96bWp3b1ZpYm8KS3lmWGtjOTFaRkU9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" [90m->[0m [0m[90mnull[0m[0m
            },
        ]
      [31m-[0m [0m[1m[0mendpoint[0m[0m                  = "https://03ABA90BCA836B37BA7F932E0768B82B.gr7.us-east-1.eks.amazonaws.com" [90m->[0m [0m[90mnull[0m[0m
        [1m[0mid[0m[0m                        = "eks-dev-cluster"
      [33m~[0m [0m[1m[0midentity[0m[0m                  = [
          [33m~[0m [0m{
              [33m~[0m [0moidc = [
                  [33m~[0m [0m{
                      [33m~[0m [0missuer = "https://oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B" [90m->[0m [0m[90mnull[0m[0m
                    },
                ]
            },
        ]
      [31m-[0m [0m[1m[0mname[0m[0m                      = "eks-dev-cluster" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mplatform_version[0m[0m          = "eks.6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mstatus[0m[0m                    = "ACTIVE" [90m->[0m [0m[90mnull[0m[0m
        [1m[0mtags[0m[0m                      = {}
      [31m-[0m [0m[1m[0mversion[0m[0m                   = "1.27" [90m->[0m [0m[90mnull[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mvpc_config {
          [31m-[0m [0m[1m[0mcluster_security_group_id[0m[0m = "sg-061b73adccf207837" [90m->[0m [0m[90mnull[0m[0m
            [90m# (6 unchanged attributes hidden)[0m[0m
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_eks_node_group.this[0][0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_eks_node_group" "this" {
      [31m-[0m [0m[1m[0marn[0m[0m                    = "arn:aws:eks:us-east-1:152691795422:nodegroup/eks-dev-cluster/bottlerocket_nodes-20231022142719580600000001/38c5abe4-4062-7732-231d-09135a8588f9" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                     = "eks-dev-cluster:bottlerocket_nodes-20231022142719580600000001" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresources[0m[0m              = [
          [31m-[0m [0m{
              [31m-[0m [0mautoscaling_groups              = [
                  [31m-[0m [0m{
                      [31m-[0m [0mname = "eks-bottlerocket_nodes-20231022142719580600000001-38c5abe4-4062-7732-231d-09135a8588f9"
                    },
                ]
              [31m-[0m [0mremote_access_security_group_id = ""
            },
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mstatus[0m[0m                 = "ACTIVE" [90m->[0m [0m[90mnull[0m[0m
        [1m[0mtags[0m[0m                   = {
            "Name" = "bottlerocket_nodes"
        }
        [90m# (13 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[32m+[0m/[31m-[0m create replacement and then destroy
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # helm_release.lb[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "helm_release" "lb" {
      [32m+[0m [0m[1m[0matomic[0m[0m                     = false
      [32m+[0m [0m[1m[0mchart[0m[0m                      = "aws-load-balancer-controller"
      [32m+[0m [0m[1m[0mcleanup_on_fail[0m[0m            = false
      [32m+[0m [0m[1m[0mcreate_namespace[0m[0m           = false
      [32m+[0m [0m[1m[0mdependency_update[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_crd_hooks[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_openapi_validation[0m[0m = false
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m           = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlint[0m[0m                       = false
      [32m+[0m [0m[1m[0mmanifest[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_history[0m[0m                = 0
      [32m+[0m [0m[1m[0mmetadata[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "aws-load-balancer-controller"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                  = "kube-system"
      [32m+[0m [0m[1m[0mpass_credentials[0m[0m           = false
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m              = false
      [32m+[0m [0m[1m[0mrender_subchart_notes[0m[0m      = true
      [32m+[0m [0m[1m[0mreplace[0m[0m                    = false
      [32m+[0m [0m[1m[0mrepository[0m[0m                 = "https://aws.github.io/eks-charts"
      [32m+[0m [0m[1m[0mreset_values[0m[0m               = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m               = false
      [32m+[0m [0m[1m[0mskip_crds[0m[0m                  = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                     = "deployed"
      [32m+[0m [0m[1m[0mtimeout[0m[0m                    = 300
      [32m+[0m [0m[1m[0mverify[0m[0m                     = false
      [32m+[0m [0m[1m[0mversion[0m[0m                    = "1.6.1"
      [32m+[0m [0m[1m[0mwait[0m[0m                       = true
      [32m+[0m [0m[1m[0mwait_for_jobs[0m[0m              = false

      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "clusterName"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "eks-dev-cluster"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "image.repository"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "602401143452.dkr.ecr.us-east-1.amazonaws.com/amazon/aws-load-balancer-controller"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "region"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "us-east-1"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "serviceAccount.create"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "false"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "serviceAccount.name"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "aws-load-balancer-controller-dev"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "vpcId"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "vpc-0f2086589399ac0a3"
        }
    }

[1m  # kubernetes_service_account.lb-service-account[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_service_account" "lb-service-account" {
      [32m+[0m [0m[1m[0mautomount_service_account_token[0m[0m = true
      [32m+[0m [0m[1m[0mdefault_secret_name[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = {
              [32m+[0m [0m"eks.amazonaws.com/role-arn"               = "arn:aws:iam::152691795422:role/aws-load-balancer-controller-dev"
              [32m+[0m [0m"eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"app.kubernetes.io/component" = "controller"
              [32m+[0m [0m"app.kubernetes.io/name"      = "aws-load-balancer-controller-dev"
            }
          [32m+[0m [0m[1m[0mname[0m[0m             = "aws-load-balancer-controller-dev"
          [32m+[0m [0m[1m[0mnamespace[0m[0m        = "kube-system"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # module.eks.data.aws_eks_addon_version.this["coredns"][0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m [0m[1m[0maddon_name[0m[0m         = "coredns"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_version[0m[0m = "1.27"
      [32m+[0m [0m[1m[0mmost_recent[0m[0m        = true
      [32m+[0m [0m[1m[0mversion[0m[0m            = (known after apply)
    }

[1m  # module.eks.data.aws_eks_addon_version.this["kube-proxy"][0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m [0m[1m[0maddon_name[0m[0m         = "kube-proxy"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_version[0m[0m = "1.27"
      [32m+[0m [0m[1m[0mmost_recent[0m[0m        = true
      [32m+[0m [0m[1m[0mversion[0m[0m            = (known after apply)
    }

[1m  # module.eks.data.aws_eks_addon_version.this["vpc-cni"][0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m [0m[1m[0maddon_name[0m[0m         = "vpc-cni"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_version[0m[0m = "1.27"
      [32m+[0m [0m[1m[0mmost_recent[0m[0m        = true
      [32m+[0m [0m[1m[0mversion[0m[0m            = (known after apply)
    }

[1m  # module.eks.data.tls_certificate.this[0][0m will be read during apply[0m
  # (config refers to values not yet known)[0m
[0m [36m<=[0m[0m data "tls_certificate" "this" {
      [32m+[0m [0m[1m[0mcertificates[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m          = (known after apply)
    }

[1m  # module.eks.aws_eks_addon.this["coredns"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m [0m[1m[0maddon_name[0m[0m           = "coredns"
      [32m+[0m [0m[1m[0maddon_version[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mcluster_name[0m[0m         = "eks-dev-cluster"
      [32m+[0m [0m[1m[0mconfiguration_values[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmodified_at[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresolve_conflicts[0m[0m    = "OVERWRITE"
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"ManagedBy" = "terraform"
          [32m+[0m [0m"Project"   = "golden-devops"
        }

      [32m+[0m [0mtimeouts {}
    }

[1m  # module.eks.aws_eks_addon.this["kube-proxy"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m [0m[1m[0maddon_name[0m[0m           = "kube-proxy"
      [32m+[0m [0m[1m[0maddon_version[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mcluster_name[0m[0m         = "eks-dev-cluster"
      [32m+[0m [0m[1m[0mconfiguration_values[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmodified_at[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresolve_conflicts[0m[0m    = "OVERWRITE"
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"ManagedBy" = "terraform"
          [32m+[0m [0m"Project"   = "golden-devops"
        }

      [32m+[0m [0mtimeouts {}
    }

[1m  # module.eks.aws_eks_addon.this["vpc-cni"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m [0m[1m[0maddon_name[0m[0m           = "vpc-cni"
      [32m+[0m [0m[1m[0maddon_version[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mcluster_name[0m[0m         = "eks-dev-cluster"
      [32m+[0m [0m[1m[0mconfiguration_values[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmodified_at[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresolve_conflicts[0m[0m    = "OVERWRITE"
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"ManagedBy" = "terraform"
          [32m+[0m [0m"Project"   = "golden-devops"
        }

      [32m+[0m [0mtimeouts {}
    }

[1m  # module.eks.aws_eks_cluster.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_cluster" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_authority[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcluster_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0menabled_cluster_log_types[0m[0m = [
          [32m+[0m [0m"api",
          [32m+[0m [0m"audit",
          [32m+[0m [0m"authenticator",
          [32m+[0m [0m"controllerManager",
          [32m+[0m [0m"scheduler",
        ]
      [32m+[0m [0m[1m[0mendpoint[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0midentity[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "eks-dev-cluster"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrole_arn[0m[0m                  = "arn:aws:iam::152691795422:role/eks-dev-cluster-cluster-20231022133042957900000004"
      [32m+[0m [0m[1m[0mstatus[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                  = {
          [32m+[0m [0m"ManagedBy" = "terraform"
          [32m+[0m [0m"Project"   = "golden-devops"
        }
      [32m+[0m [0m[1m[0mversion[0m[0m                   = "1.27"

      [32m+[0m [0mencryption_config {
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"secrets",
            ]

          [32m+[0m [0mprovider {
              [32m+[0m [0m[1m[0mkey_arn[0m[0m = "arn:aws:kms:us-east-1:152691795422:key/3d9482df-eb16-4741-850a-8973102eccb6"
            }
        }

      [32m+[0m [0mkubernetes_network_config {
          [32m+[0m [0m[1m[0mip_family[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mservice_ipv4_cidr[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mservice_ipv6_cidr[0m[0m = (known after apply)
        }

      [32m+[0m [0mtimeouts {}

      [32m+[0m [0mvpc_config {
          [32m+[0m [0m[1m[0mcluster_security_group_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mendpoint_private_access[0m[0m   = true
          [32m+[0m [0m[1m[0mendpoint_public_access[0m[0m    = true
          [32m+[0m [0m[1m[0mpublic_access_cidrs[0m[0m       = [
              [32m+[0m [0m"31.60.0.0/14",
              [32m+[0m [0m"37.108.0.0/16",
              [32m+[0m [0m"37.225.0.0/16",
              [32m+[0m [0m"37.47.0.0/16",
              [32m+[0m [0m"46.134.0.0/16",
              [32m+[0m [0m"5.184.0.0/15",
            ]
          [32m+[0m [0m[1m[0msecurity_group_ids[0m[0m        = [
              [32m+[0m [0m"sg-0d9b80ef0ea23ef75",
            ]
          [32m+[0m [0m[1m[0msubnet_ids[0m[0m                = [
              [32m+[0m [0m"subnet-017b32e15af7aa8bd",
              [32m+[0m [0m"subnet-07c65006d85b78ff0",
              [32m+[0m [0m"subnet-094b0d7289f46e738",
            ]
          [32m+[0m [0m[1m[0mvpc_id[0m[0m                    = (known after apply)
        }
    }

[1m  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_iam_openid_connect_provider" "oidc_provider" {
      [33m~[0m [0m[1m[0marn[0m[0m             = "arn:aws:iam::152691795422:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m              = "arn:aws:iam::152691795422:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B" [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m            = {
            "Name" = "eks-dev-cluster-eks-irsa"
        }
      [33m~[0m [0m[1m[0mthumbprint_list[0m[0m = [
          [31m-[0m [0m"9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0murl[0m[0m             = "oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.kubernetes_config_map_v1_data.aws_auth[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_config_map_v1_data" "aws_auth" {
      [32m+[0m [0m[1m[0mdata[0m[0m          = {
          [32m+[0m [0m"mapAccounts" = jsonencode([])
          [32m+[0m [0m"mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::152691795422:role/bottlerocket_nodes-eks-node-group-20231022133042956900000003"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          [32m+[0m [0m"mapUsers"    = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::152691795422:user/jakubszuber-admin"
                  "username": "cluster-admin"
            EOT
        }
      [32m+[0m [0m[1m[0mfield_manager[0m[0m = "Terraform"
      [32m+[0m [0m[1m[0mforce[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mname[0m[0m      = "aws-auth"
          [32m+[0m [0m[1m[0mnamespace[0m[0m = "kube-system"
        }
    }

[1m  # module.eks.time_sleep.this[0][0m must be [1m[31mreplaced[0m[0m
[0m[32m+[0m/[31m-[0m[0m resource "time_sleep" "this" {
      [33m~[0m [0m[1m[0mid[0m[0m              = "2023-10-22T13:41:58Z" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtriggers[0m[0m        = { [31m# forces replacement[0m[0m
          [33m~[0m [0m"cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCRENDQWV5Z0F3SUJBZ0lIU0VTV2gya3JUekFOQmdrcWhraUc5dzBCQVFzRkFEQVZNUk13RVFZRFZRUUQKRXdwcmRXSmxjbTVsZEdWek1CNFhEVEl6TVRBeU1qRXpNekV5TVZvWERUTXpNVEF4T1RFek16WXlNVm93RlRFVApNQkVHQTFVRUF4TUthM1ZpWlhKdVpYUmxjekNDQVNJd0RRWUpLb1pJaHZjTkFRRUJCUUFEZ2dFUEFEQ0NBUW9DCmdnRUJBS1lIeWRtNTRuUEYwdDF5eUp2ZEJYcHN5ZURmdVgzcGU4czJEMVFYUlMwMXRtdDVMZDJhd0FjWVhab1AKU1cxTnJmTWF4cEV5TktqVlQvdHhnMmJMRWVHcC9ubjhNVERxSGYxWnhYV2c2a1Zsa3R6UjRSLytaTXR2ajJteQpaVjBxMWNCaGN2NU5CNzRWNVpvMTlLSGM1NkdmTjRTOHBKa2tnN2JIdktYcWwxdFJ4SkxETXZmYkt5UlJQdlZRCkJxVEsrODJ1YkhxbmdJeEM4VS9nOEZhTUEyVGQwQjIzcjVzWVN0SFRoNEQydFlGdlhNa251b21uaUFxaGVmOEsKQzh5cjM2bkQ5RU10Y0pUTlREVmFLamhqU0FzaytvK1cwaldYbXpjVi9zOVFsSmlFcEV5MjlWU1JpcmtQY2NGaAoxcnRUWlIwWUpTUjlGVVZQVkI5TEVYK2VTWWNDQXdFQUFhTlpNRmN3RGdZRFZSMFBBUUgvQkFRREFnS2tNQThHCkExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRlBUVmY4OHJBdW8vQzBwOG9Mb09Bc052bFZOTk1CVUcKQTFVZEVRUU9NQXlDQ210MVltVnlibVYwWlhNd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDMExNS0luRytMUgp4bi81VkZwMXRjUWw3cSttaGZqVE85OHRvUU56UTlkZFAwQVY3UGJPVGhMd3MzaEdadlB1cUVYc3UzQTJTWnZVCmxxSUxIeERadzF5S3o2WmF1Yklza2RCL0xON0NJRFM2QVJ6QWd6UWwyYnYzcktNNTgvNG1CVi9BNm9TemJlQzcKbVZYYVFuMVJVTDRKMVlaQ2tUbXZ1KzMxQUZKa21rcng2cXB0U0NnSEMzUnR4VDhnTC9qa05zdEt3U1VXVjVyQQpqVEtpRHliMVVRdjJZQ2ZObVhzanU1Y3J6NWtVTkdNVFRya3I3NXlvYU5FeG96azdEQW0xSFpNcUhKaW5yYnpCCmxNN0VhVk11UEQ5eXIrSENNWEdUdWJVdUc1bDVIZGZ5eFN1dEVVZXljcTYzN2lsMUV4U05kKy96bWp3b1ZpYm8KS3lmWGtjOTFaRkU9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" [33m->[0m [0m(known after apply)
          [33m~[0m [0m"cluster_endpoint"                   = "https://03ABA90BCA836B37BA7F932E0768B82B.gr7.us-east-1.eks.amazonaws.com" [33m->[0m [0m(known after apply)
            [90m# (2 unchanged elements hidden)[0m[0m
        }
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.lb_role.data.aws_caller_identity.current[0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0muser_id[0m[0m    = (known after apply)
    }

[1m  # module.lb_role.data.aws_iam_policy_document.load_balancer_controller[0][0m will be read during apply[0m
  # (config refers to values not yet known)[0m
[0m [36m<=[0m[0m data "aws_iam_policy_document" "load_balancer_controller" {
      [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mjson[0m[0m = (known after apply)

      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"iam:CreateServiceLinkedRole",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "StringEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m(known after apply),
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "iam:AWSServiceName"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ec2:DescribeAccountAttributes",
              [32m+[0m [0m"ec2:DescribeAddresses",
              [32m+[0m [0m"ec2:DescribeAvailabilityZones",
              [32m+[0m [0m"ec2:DescribeCoipPools",
              [32m+[0m [0m"ec2:DescribeInstances",
              [32m+[0m [0m"ec2:DescribeInternetGateways",
              [32m+[0m [0m"ec2:DescribeNetworkInterfaces",
              [32m+[0m [0m"ec2:DescribeSecurityGroups",
              [32m+[0m [0m"ec2:DescribeSubnets",
              [32m+[0m [0m"ec2:DescribeTags",
              [32m+[0m [0m"ec2:DescribeVpcPeeringConnections",
              [32m+[0m [0m"ec2:DescribeVpcs",
              [32m+[0m [0m"ec2:GetCoipPoolUsage",
              [32m+[0m [0m"elasticloadbalancing:DescribeListenerCertificates",
              [32m+[0m [0m"elasticloadbalancing:DescribeListeners",
              [32m+[0m [0m"elasticloadbalancing:DescribeLoadBalancerAttributes",
              [32m+[0m [0m"elasticloadbalancing:DescribeLoadBalancers",
              [32m+[0m [0m"elasticloadbalancing:DescribeRules",
              [32m+[0m [0m"elasticloadbalancing:DescribeSSLPolicies",
              [32m+[0m [0m"elasticloadbalancing:DescribeTags",
              [32m+[0m [0m"elasticloadbalancing:DescribeTargetGroupAttributes",
              [32m+[0m [0m"elasticloadbalancing:DescribeTargetGroups",
              [32m+[0m [0m"elasticloadbalancing:DescribeTargetHealth",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"acm:DescribeCertificate",
              [32m+[0m [0m"acm:ListCertificates",
              [32m+[0m [0m"cognito-idp:DescribeUserPoolClient",
              [32m+[0m [0m"iam:GetServerCertificate",
              [32m+[0m [0m"iam:ListServerCertificates",
              [32m+[0m [0m"shield:CreateProtection",
              [32m+[0m [0m"shield:DeleteProtection",
              [32m+[0m [0m"shield:DescribeProtection",
              [32m+[0m [0m"shield:GetSubscriptionState",
              [32m+[0m [0m"waf-regional:AssociateWebACL",
              [32m+[0m [0m"waf-regional:DisassociateWebACL",
              [32m+[0m [0m"waf-regional:GetWebACL",
              [32m+[0m [0m"waf-regional:GetWebACLForResource",
              [32m+[0m [0m"wafv2:AssociateWebACL",
              [32m+[0m [0m"wafv2:DisassociateWebACL",
              [32m+[0m [0m"wafv2:GetWebACL",
              [32m+[0m [0m"wafv2:GetWebACLForResource",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ec2:AuthorizeSecurityGroupIngress",
              [32m+[0m [0m"ec2:CreateSecurityGroup",
              [32m+[0m [0m"ec2:RevokeSecurityGroupIngress",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ec2:CreateTags",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "StringEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"CreateSecurityGroup",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "ec2:CreateAction"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ec2:CreateTags",
              [32m+[0m [0m"ec2:DeleteTags",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"true",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ec2:AuthorizeSecurityGroupIngress",
              [32m+[0m [0m"ec2:DeleteSecurityGroup",
              [32m+[0m [0m"ec2:RevokeSecurityGroupIngress",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:AddTags",
              [32m+[0m [0m"elasticloadbalancing:CreateLoadBalancer",
              [32m+[0m [0m"elasticloadbalancing:CreateTargetGroup",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:AddTags",
              [32m+[0m [0m"elasticloadbalancing:CreateListener",
              [32m+[0m [0m"elasticloadbalancing:CreateRule",
              [32m+[0m [0m"elasticloadbalancing:DeleteListener",
              [32m+[0m [0m"elasticloadbalancing:DeleteRule",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:AddTags",
              [32m+[0m [0m"elasticloadbalancing:RemoveTags",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"true",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:AddTags",
              [32m+[0m [0m"elasticloadbalancing:RemoveTags",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:DeleteLoadBalancer",
              [32m+[0m [0m"elasticloadbalancing:DeleteTargetGroup",
              [32m+[0m [0m"elasticloadbalancing:ModifyLoadBalancerAttributes",
              [32m+[0m [0m"elasticloadbalancing:ModifyTargetGroup",
              [32m+[0m [0m"elasticloadbalancing:ModifyTargetGroupAttributes",
              [32m+[0m [0m"elasticloadbalancing:SetIpAddressType",
              [32m+[0m [0m"elasticloadbalancing:SetSecurityGroups",
              [32m+[0m [0m"elasticloadbalancing:SetSubnets",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:AddTags",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
              [32m+[0m [0m(known after apply),
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Null"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"false",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "StringEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"CreateTargetGroup",
                  [32m+[0m [0m"CreateLoadBalancer",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "elasticloadbalancing:CreateAction"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:DeregisterTargets",
              [32m+[0m [0m"elasticloadbalancing:RegisterTargets",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticloadbalancing:AddListenerCertificates",
              [32m+[0m [0m"elasticloadbalancing:ModifyListener",
              [32m+[0m [0m"elasticloadbalancing:ModifyRule",
              [32m+[0m [0m"elasticloadbalancing:RemoveListenerCertificates",
              [32m+[0m [0m"elasticloadbalancing:SetWebAcl",
            ]
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }
    }

[1m  # module.lb_role.data.aws_iam_policy_document.this[0][0m will be read during apply[0m
  # (config refers to values not yet known)[0m
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mjson[0m[0m = (known after apply)

      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m = [
              [32m+[0m [0m"sts:AssumeRoleWithWebIdentity",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m  = "Allow"

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "StringEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"sts.amazonaws.com",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = (known after apply)
            }
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "StringEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"system:serviceaccount:kube-system:aws-load-balancer-controller-dev",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = (known after apply)
            }

          [32m+[0m [0mprincipals {
              [32m+[0m [0m[1m[0midentifiers[0m[0m = [
                  [32m+[0m [0m(known after apply),
                ]
              [32m+[0m [0m[1m[0mtype[0m[0m        = "Federated"
            }
        }
    }

[1m  # module.lb_role.data.aws_partition.current[0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "aws_partition" "current" {
      [32m+[0m [0m[1m[0mdns_suffix[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mpartition[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mreverse_dns_prefix[0m[0m = (known after apply)
    }

[1m  # module.lb_role.data.aws_region.current[0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "aws_region" "current" {
      [32m+[0m [0m[1m[0mdescription[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = (known after apply)
    }

[1m  # module.lb_role.aws_iam_policy.load_balancer_controller[0][0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_iam_policy" "load_balancer_controller" {
        [1m[0mid[0m[0m          = "arn:aws:iam::152691795422:policy/AmazonEKS_AWS_Load_Balancer_Controller-20231022145135328400000001"
        [1m[0mname[0m[0m        = "AmazonEKS_AWS_Load_Balancer_Controller-20231022145135328400000001"
      [33m~[0m [0m[1m[0mpolicy[0m[0m      = jsonencode(
            {
              [31m-[0m [0mStatement = [
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = "iam:CreateServiceLinkedRole"
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mStringEquals = {
                              [31m-[0m [0m"iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"elasticloadbalancing:DescribeTargetHealth",
                          [31m-[0m [0m"elasticloadbalancing:DescribeTargetGroups",
                          [31m-[0m [0m"elasticloadbalancing:DescribeTargetGroupAttributes",
                          [31m-[0m [0m"elasticloadbalancing:DescribeTags",
                          [31m-[0m [0m"elasticloadbalancing:DescribeSSLPolicies",
                          [31m-[0m [0m"elasticloadbalancing:DescribeRules",
                          [31m-[0m [0m"elasticloadbalancing:DescribeLoadBalancers",
                          [31m-[0m [0m"elasticloadbalancing:DescribeLoadBalancerAttributes",
                          [31m-[0m [0m"elasticloadbalancing:DescribeListeners",
                          [31m-[0m [0m"elasticloadbalancing:DescribeListenerCertificates",
                          [31m-[0m [0m"ec2:GetCoipPoolUsage",
                          [31m-[0m [0m"ec2:DescribeVpcs",
                          [31m-[0m [0m"ec2:DescribeVpcPeeringConnections",
                          [31m-[0m [0m"ec2:DescribeTags",
                          [31m-[0m [0m"ec2:DescribeSubnets",
                          [31m-[0m [0m"ec2:DescribeSecurityGroups",
                          [31m-[0m [0m"ec2:DescribeNetworkInterfaces",
                          [31m-[0m [0m"ec2:DescribeInternetGateways",
                          [31m-[0m [0m"ec2:DescribeInstances",
                          [31m-[0m [0m"ec2:DescribeCoipPools",
                          [31m-[0m [0m"ec2:DescribeAvailabilityZones",
                          [31m-[0m [0m"ec2:DescribeAddresses",
                          [31m-[0m [0m"ec2:DescribeAccountAttributes",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"wafv2:GetWebACLForResource",
                          [31m-[0m [0m"wafv2:GetWebACL",
                          [31m-[0m [0m"wafv2:DisassociateWebACL",
                          [31m-[0m [0m"wafv2:AssociateWebACL",
                          [31m-[0m [0m"waf-regional:GetWebACLForResource",
                          [31m-[0m [0m"waf-regional:GetWebACL",
                          [31m-[0m [0m"waf-regional:DisassociateWebACL",
                          [31m-[0m [0m"waf-regional:AssociateWebACL",
                          [31m-[0m [0m"shield:GetSubscriptionState",
                          [31m-[0m [0m"shield:DescribeProtection",
                          [31m-[0m [0m"shield:DeleteProtection",
                          [31m-[0m [0m"shield:CreateProtection",
                          [31m-[0m [0m"iam:ListServerCertificates",
                          [31m-[0m [0m"iam:GetServerCertificate",
                          [31m-[0m [0m"cognito-idp:DescribeUserPoolClient",
                          [31m-[0m [0m"acm:ListCertificates",
                          [31m-[0m [0m"acm:DescribeCertificate",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"ec2:RevokeSecurityGroupIngress",
                          [31m-[0m [0m"ec2:CreateSecurityGroup",
                          [31m-[0m [0m"ec2:AuthorizeSecurityGroupIngress",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = "ec2:CreateTags"
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull         = {
                              [31m-[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          [31m-[0m [0mStringEquals = {
                              [31m-[0m [0m"ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = [
                          [31m-[0m [0m"ec2:DeleteTags",
                          [31m-[0m [0m"ec2:CreateTags",
                        ]
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull = {
                              [31m-[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              [31m-[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = [
                          [31m-[0m [0m"ec2:RevokeSecurityGroupIngress",
                          [31m-[0m [0m"ec2:DeleteSecurityGroup",
                          [31m-[0m [0m"ec2:AuthorizeSecurityGroupIngress",
                        ]
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull = {
                              [31m-[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = [
                          [31m-[0m [0m"elasticloadbalancing:CreateTargetGroup",
                          [31m-[0m [0m"elasticloadbalancing:CreateLoadBalancer",
                          [31m-[0m [0m"elasticloadbalancing:AddTags",
                        ]
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull = {
                              [31m-[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"elasticloadbalancing:DeleteRule",
                          [31m-[0m [0m"elasticloadbalancing:DeleteListener",
                          [31m-[0m [0m"elasticloadbalancing:CreateRule",
                          [31m-[0m [0m"elasticloadbalancing:CreateListener",
                          [31m-[0m [0m"elasticloadbalancing:AddTags",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = [
                          [31m-[0m [0m"elasticloadbalancing:RemoveTags",
                          [31m-[0m [0m"elasticloadbalancing:AddTags",
                        ]
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull = {
                              [31m-[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              [31m-[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = [
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"elasticloadbalancing:RemoveTags",
                          [31m-[0m [0m"elasticloadbalancing:AddTags",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = [
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = [
                          [31m-[0m [0m"elasticloadbalancing:SetSubnets",
                          [31m-[0m [0m"elasticloadbalancing:SetSecurityGroups",
                          [31m-[0m [0m"elasticloadbalancing:SetIpAddressType",
                          [31m-[0m [0m"elasticloadbalancing:ModifyTargetGroupAttributes",
                          [31m-[0m [0m"elasticloadbalancing:ModifyTargetGroup",
                          [31m-[0m [0m"elasticloadbalancing:ModifyLoadBalancerAttributes",
                          [31m-[0m [0m"elasticloadbalancing:DeleteTargetGroup",
                          [31m-[0m [0m"elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull = {
                              [31m-[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = "*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = "elasticloadbalancing:AddTags"
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mNull         = {
                              [31m-[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          [31m-[0m [0mStringEquals = {
                              [31m-[0m [0m"elasticloadbalancing:CreateAction" = [
                                  [31m-[0m [0m"CreateTargetGroup",
                                  [31m-[0m [0m"CreateLoadBalancer",
                                ]
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mResource  = [
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          [31m-[0m [0m"arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"elasticloadbalancing:RegisterTargets",
                          [31m-[0m [0m"elasticloadbalancing:DeregisterTargets",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  [31m-[0m [0m{
                      [31m-[0m [0mAction   = [
                          [31m-[0m [0m"elasticloadbalancing:SetWebAcl",
                          [31m-[0m [0m"elasticloadbalancing:RemoveListenerCertificates",
                          [31m-[0m [0m"elasticloadbalancing:ModifyRule",
                          [31m-[0m [0m"elasticloadbalancing:ModifyListener",
                          [31m-[0m [0m"elasticloadbalancing:AddListenerCertificates",
                        ]
                      [31m-[0m [0mEffect   = "Allow"
                      [31m-[0m [0mResource = "*"
                    },
                ]
              [31m-[0m [0mVersion   = "2012-10-17"
            }
        ) [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m        = {}
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lb_role.aws_iam_role.this[0][0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_iam_role" "this" {
      [33m~[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [31m-[0m [0mStatement = [
                  [31m-[0m [0m{
                      [31m-[0m [0mAction    = "sts:AssumeRoleWithWebIdentity"
                      [31m-[0m [0mCondition = {
                          [31m-[0m [0mStringEquals = {
                              [31m-[0m [0m"oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B:aud" = "sts.amazonaws.com"
                              [31m-[0m [0m"oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller-dev"
                            }
                        }
                      [31m-[0m [0mEffect    = "Allow"
                      [31m-[0m [0mPrincipal = {
                          [31m-[0m [0mFederated = "arn:aws:iam::152691795422:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/03ABA90BCA836B37BA7F932E0768B82B"
                        }
                    },
                ]
              [31m-[0m [0mVersion   = "2012-10-17"
            }
        ) [33m->[0m [0m(known after apply)
        [1m[0mid[0m[0m                    = "aws-load-balancer-controller-dev"
        [1m[0mname[0m[0m                  = "aws-load-balancer-controller-dev"
        [1m[0mtags[0m[0m                  = {}
        [90m# (8 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.module.eks_managed_node_group["bottlerocket_nodes"].aws_eks_node_group.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_node_group" "this" {
      [32m+[0m [0m[1m[0mami_type[0m[0m               = "BOTTLEROCKET_x86_64"
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcapacity_type[0m[0m          = "SPOT"
      [32m+[0m [0m[1m[0mcluster_name[0m[0m           = "eks-dev-cluster"
      [32m+[0m [0m[1m[0mdisk_size[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_types[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mnode_group_name[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mnode_group_name_prefix[0m[0m = "bottlerocket_nodes-"
      [32m+[0m [0m[1m[0mnode_role_arn[0m[0m          = "arn:aws:iam::152691795422:role/bottlerocket_nodes-eks-node-group-20231022133042956900000003"
      [32m+[0m [0m[1m[0mrelease_version[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresources[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m             = [
          [32m+[0m [0m"subnet-017b32e15af7aa8bd",
          [32m+[0m [0m"subnet-07c65006d85b78ff0",
          [32m+[0m [0m"subnet-094b0d7289f46e738",
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Name" = "bottlerocket_nodes"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"ManagedBy" = "terraform"
          [32m+[0m [0m"Name"      = "bottlerocket_nodes"
          [32m+[0m [0m"Project"   = "golden-devops"
        }
      [32m+[0m [0m[1m[0mversion[0m[0m                = "1.27"

      [32m+[0m [0mlaunch_template {
          [32m+[0m [0m[1m[0mid[0m[0m      = "lt-0d20f4f3e63b0b7a2"
          [32m+[0m [0m[1m[0mname[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m = "1"
        }

      [32m+[0m [0mscaling_config {
          [32m+[0m [0m[1m[0mdesired_size[0m[0m = 1
          [32m+[0m [0m[1m[0mmax_size[0m[0m     = 2
          [32m+[0m [0m[1m[0mmin_size[0m[0m     = 1
        }

      [32m+[0m [0mtimeouts {}

      [32m+[0m [0mupdate_config {
          [32m+[0m [0m[1m[0mmax_unavailable_percentage[0m[0m = 33
        }
    }

[0m[1mPlan:[0m 10 to add, 2 to change, 2 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mcluster_certificate_authority_data[0m[0m = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCRENDQWV5Z0F3SUJBZ0lIU0VTV2gya3JUekFOQmdrcWhraUc5dzBCQVFzRkFEQVZNUk13RVFZRFZRUUQKRXdwcmRXSmxjbTVsZEdWek1CNFhEVEl6TVRBeU1qRXpNekV5TVZvWERUTXpNVEF4T1RFek16WXlNVm93RlRFVApNQkVHQTFVRUF4TUthM1ZpWlhKdVpYUmxjekNDQVNJd0RRWUpLb1pJaHZjTkFRRUJCUUFEZ2dFUEFEQ0NBUW9DCmdnRUJBS1lIeWRtNTRuUEYwdDF5eUp2ZEJYcHN5ZURmdVgzcGU4czJEMVFYUlMwMXRtdDVMZDJhd0FjWVhab1AKU1cxTnJmTWF4cEV5TktqVlQvdHhnMmJMRWVHcC9ubjhNVERxSGYxWnhYV2c2a1Zsa3R6UjRSLytaTXR2ajJteQpaVjBxMWNCaGN2NU5CNzRWNVpvMTlLSGM1NkdmTjRTOHBKa2tnN2JIdktYcWwxdFJ4SkxETXZmYkt5UlJQdlZRCkJxVEsrODJ1YkhxbmdJeEM4VS9nOEZhTUEyVGQwQjIzcjVzWVN0SFRoNEQydFlGdlhNa251b21uaUFxaGVmOEsKQzh5cjM2bkQ5RU10Y0pUTlREVmFLamhqU0FzaytvK1cwaldYbXpjVi9zOVFsSmlFcEV5MjlWU1JpcmtQY2NGaAoxcnRUWlIwWUpTUjlGVVZQVkI5TEVYK2VTWWNDQXdFQUFhTlpNRmN3RGdZRFZSMFBBUUgvQkFRREFnS2tNQThHCkExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRlBUVmY4OHJBdW8vQzBwOG9Mb09Bc052bFZOTk1CVUcKQTFVZEVRUU9NQXlDQ210MVltVnlibVYwWlhNd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDMExNS0luRytMUgp4bi81VkZwMXRjUWw3cSttaGZqVE85OHRvUU56UTlkZFAwQVY3UGJPVGhMd3MzaEdadlB1cUVYc3UzQTJTWnZVCmxxSUxIeERadzF5S3o2WmF1Yklza2RCL0xON0NJRFM2QVJ6QWd6UWwyYnYzcktNNTgvNG1CVi9BNm9TemJlQzcKbVZYYVFuMVJVTDRKMVlaQ2tUbXZ1KzMxQUZKa21rcng2cXB0U0NnSEMzUnR4VDhnTC9qa05zdEt3U1VXVjVyQQpqVEtpRHliMVVRdjJZQ2ZObVhzanU1Y3J6NWtVTkdNVFRya3I3NXlvYU5FeG96azdEQW0xSFpNcUhKaW5yYnpCCmxNN0VhVk11UEQ5eXIrSENNWEdUdWJVdUc1bDVIZGZ5eFN1dEVVZXljcTYzN2lsMUV4U05kKy96bWp3b1ZpYm8KS3lmWGtjOTFaRkU9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" [33m->[0m [0m(known after apply)
  [33m~[0m [0m[1m[0mcluster_endpoint[0m[0m                   = "https://03ABA90BCA836B37BA7F932E0768B82B.gr7.us-east-1.eks.amazonaws.com" [33m->[0m [0m(known after apply)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.eks.aws_eks_addon.this["coredns"],
[33m│[0m [0m  on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
[33m│[0m [0m 392:   resolve_conflicts        = [4mtry(each.value.resolve_conflicts, "OVERWRITE")[0m[0m
[33m│[0m [0m
[33m│[0m [0mThe "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
[33m│[0m [0mresource creation. Use "resolve_conflicts_on_create" and/or
[33m│[0m [0m"resolve_conflicts_on_update" instead
[33m│[0m [0m
[33m│[0m [0m(and 2 more similar warnings elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*